In [2]:
!pip install pandas
import pandas as pd

Requirement already satisfied: pandas in d:\ml_learning\prime_batch\ml\venv\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.23.2 in d:\ml_learning\prime_batch\ml\venv\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\ml_learning\prime_batch\ml\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\ml_learning\prime_batch\ml\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in d:\ml_learning\prime_batch\ml\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in d:\ml_learning\prime_batch\ml\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip available: 22.3 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [5]:
info = {
    "Name": ["Rahul","Harshita","Rakesh"],
    "CGPA": [9.5,7.5,8.5]
}
df = pd.DataFrame(info)

In [6]:
df

       Name  CGPA
0     Rahul   9.5
1  Harshita   7.5
2    Rakesh   8.5

In [10]:
s = pd.Series([23,24,25],index=["Adam","Eve","Hari"])
print(s)
print(s["Adam"])

Adam    23
Eve     24
Hari    25
dtype: int64
23

In [14]:
#panda series are homogeneous (same data type only stores..)
s1 = pd.Series([1,2,3])
s2 = pd.Series([10,20])  #vectorized Operations

print(s1+s2)

s2[2] = 30  #panda series are mutable but size is not mutable..
print(s2)

new_s2 = s2.drop(0)
print(new_s2)

#series handles missing values with nan

0    11.0
1    22.0
2     NaN
dtype: float64
0    10
1    20
2    30
dtype: int64
1    20
2    30
dtype: int64

In [41]:
#dataframes
info = {
    "Name": ["Rahul","Harshita","Rakesh"],
    "CGPA": [9.5,7.5,8.5]
}

n_info = pd.DataFrame([['Rahul',9.53],['Harsh',3.3]], columns = ['Name','Age'])
print(n_info)

df = pd.DataFrame(info)
df
print(type(df))
print(df.index)
print(df.columns)

    Name   Age
0  Rahul  9.53
1  Harsh  3.30
<class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'CGPA'], dtype='object')

KeyError: 'cols'

In [22]:
import numpy as np

np_arr = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(np_arr, columns = ['A','B','C'])
df

   A  B  C
0  1  2  3
1  4  5  6

In [25]:
df1 = pd.read_csv('raw_data.csv')
df1

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [26]:
df2 = pd.read_json('raw_data.json')
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6                45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0             Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA           58000.0

In [27]:
df2.head()

   id          name   age country   gender   income
0   1      John Doe  29.0     USA     Male  55000.0
1   1      John Doe  29.0     USA     Male  55000.0
2   2    Jane Smith   NaN  Canada   Female  62000.0
3   3          Alex   NaN     USA  Unknown  47000.0
4   4  Maria Garcia  34.0   Spain   Female      NaN

In [28]:
df2.head(3)

   id        name   age country  gender   income
0   1    John Doe  29.0     USA    Male  55000.0
1   1    John Doe  29.0     USA    Male  55000.0
2   2  Jane Smith   NaN  Canada  Female  62000.0

In [30]:
df2.tail()

    id         name   age country  gender   income
6    6               45.0   India  Female  73000.0
7    7   Ahmed Khan  38.0            Male  68000.0
8    8   Rachel Lee  29.0     USA  Female  62000.0
9    9  Carlos Ruiz   NaN  Mexico    Male  45000.0
10  10  Emily Davis  31.0     USA          58000.0

In [32]:
df2.sample()

   id          name   age country  gender  income
4   4  Maria Garcia  34.0   Spain  Female     NaN

In [34]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       11 non-null     int64
 1   name     11 non-null     object
 2   age      8 non-null      float64
 3   country  11 non-null     object
 4   gender   11 non-null     object
 5   income   10 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 656.0+ bytes

In [35]:
df2.describe()

              id        age        income
count  11.000000   8.000000     10.000000
mean    5.090909  32.750000  57600.000000
std     3.176619   6.065123   8896.940798
min     1.000000  27.000000  45000.000000
25%     2.500000  29.000000  52000.000000
50%     5.000000  30.000000  56500.000000
75%     7.500000  35.000000  62000.000000
max    10.000000  45.000000  73000.000000

In [37]:
df2.columns

Index(['id', 'name', 'age', 'country', 'gender', 'income'], dtype='object')

In [38]:
df2.nunique()

id         10
name       10
age         6
country     7
gender      4
income      8
dtype: int64

In [40]:
arr = np.array([1,2,3])
print(type(arr), arr.dtype)

<class 'numpy.ndarray'> int64

In [7]:
df3 = pd.read_csv("employee_data.csv")
df3[['Name','Age','Department']]

      Name  Age Department
0    Alice   25         HR
1      Bob   32         IT
2  Charlie   28    Finance
3    David   45  Marketing
4      Eva   38         IT
5    Frank   29    Finance
6    Grace   41         HR
7   Hannah   26  Marketing
8      Ian   35         IT
9    Julia   30    Finance

In [6]:
df3

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [9]:
df3.loc[0:2]   # last wala index inclusive

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000

In [10]:
df3.iloc[0:2] # last wala index exclusive

   ID   Name  Age Department  Salary
0   1  Alice   25         HR   55000
1   2    Bob   32         IT   72000

In [12]:
#selecting rows and columns..

df3.loc[0:2,["Age","Department"]]

   Age Department
0   25         HR
1   32         IT
2   28    Finance

In [13]:
df3.iloc[0:3,2:4]

   Age Department
0   25         HR
1   32         IT
2   28    Finance

In [20]:
new_data = df3[df3['Age'] > 38 ]
new_data 
new_data.iloc[0]

ID                    4
Name              David
Age                  45
Department    Marketing
Salary            91000
Name: 3, dtype: object

In [15]:
df3[ (df3['Age'] > 38) & (df3['Department'] == 'Marketing')]

   ID   Name  Age Department  Salary
3   4  David   45  Marketing   91000

In [16]:
df3[ (df3['Age'] > 38) & (df3['Department'] == 'Marketing')][['Age','Name']]

   Age   Name
3   45  David

In [22]:
# Filtering out data using query ........... 
var = 38
df3.query("Age > @var")[['Age','Name']]

   Age   Name
3   45  David
6   41  Grace

In [41]:
df = pd.read_csv('raw_data.csv')
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [24]:
df.isnull()

       id   name    age  country  gender  income
0   False  False  False    False   False   False
1   False  False  False    False   False   False
2   False  False   True    False   False   False
3   False  False   True    False   False   False
4   False  False  False    False   False    True
5   False  False  False    False   False   False
6   False   True  False    False   False   False
7   False  False  False     True   False   False
8   False  False  False    False   False   False
9   False  False   True    False   False   False
10  False  False  False    False    True   False

In [30]:
df.isnull().sum()

id         0
name       1
age        3
country    1
gender     1
income     1
dtype: int64

In [31]:
df.dropna(axis=1)

    id
0    1
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10

In [32]:
df.fillna(0)

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   0.0  Canada   Female  62000.0
3    3          Alex   0.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      0.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6             0  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0       0     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   0.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA        0  58000.0

In [34]:
age_mean = df['age'].mean()
cleaned_data = df.copy()
cleaned_data['age'] = cleaned_data['age'].fillna(age_mean)
cleaned_data

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
1    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female      NaN
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [35]:
cleaned_data['age'].duplicated()

0     False
1      True
2     False
3      True
4     False
5     False
6     False
7     False
8      True
9      True
10    False
Name: age, dtype: bool

In [39]:
cleaned_data['age'].drop_duplicates()

0     29.00
2     32.75
4     34.00
5     27.00
6     45.00
7     38.00
10    31.00
Name: age, dtype: float64

In [43]:
cleaned_data.dtypes

id           int64
name        object
age        float64
country     object
gender      object
income     float64
dtype: object